---
kind: type
id: T:Autodesk.Revit.DB.VerticalAlignmentStyle
source: html/05f94e24-2700-8551-22ba-0a69887f7d3f.htm
---
# Autodesk.Revit.DB.VerticalAlignmentStyle

Declares the vertical alignment style of font.

## Syntax (C#)
```csharp
public enum VerticalAlignmentStyle
```